mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2ghxh/common/s6e2ghxh.h
/*******************************************************************************
* BT Registers BT13
*   Register Definition
*******************************************************************************/
#define FM_BT13_PPG_PRLL                          *((volatile uint16_t*)(0x40025640UL))
#define FM4_BT13_PPG_PRLL                         *((volatile uint16_t*)(0x40025640UL))
#define FM_BT13_PWM_PCSR                          *((volatile uint16_t*)(0x40025640UL))
#define FM4_BT13_PWM_PCSR                         *((volatile uint16_t*)(0x40025640UL))
#define FM_BT13_RT_PCSR                           *((volatile uint16_t*)(0x40025640UL))
#define FM4_BT13_RT_PCSR                          *((volatile uint16_t*)(0x40025640UL))
#define FM_BT13_PPG_PRLH                          *((volatile uint16_t*)(0x40025644UL))
#define FM4_BT13_PPG_PRLH                         *((volatile uint16_t*)(0x40025644UL))
#define FM_BT13_PWC_DTBF                          *((volatile uint16_t*)(0x40025644UL))
#define FM4_BT13_PWC_DTBF                         *((volatile uint16_t*)(0x40025644UL))
#define FM_BT13_PWM_PDUT                          *((volatile uint16_t*)(0x40025644UL))
#define FM4_BT13_PWM_PDUT                         *((volatile uint16_t*)(0x40025644UL))
#define FM_BT13_PPG_TMR                           *((volatile uint16_t*)(0x40025648UL))
#define FM4_BT13_PPG_TMR                          *((volatile uint16_t*)(0x40025648UL))
#define FM_BT13_PWM_TMR                           *((volatile uint16_t*)(0x40025648UL))
#define FM4_BT13_PWM_TMR                          *((volatile uint16_t*)(0x40025648UL))
#define FM_BT13_RT_TMR                            *((volatile uint16_t*)(0x40025648UL))
#define FM4_BT13_RT_TMR                           *((volatile uint16_t*)(0x40025648UL))
#define FM_BT13_PPG_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_PPG_TMCR                         *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_PWC_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_PWC_TMCR                         *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_PWM_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_PWM_TMCR                         *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_RT_TMCR                           *((volatile uint16_t*)(0x4002564CUL))
#define FM4_BT13_RT_TMCR                          *((volatile uint16_t*)(0x4002564CUL))
#define FM_BT13_PPG_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_PPG_STC                          *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_PWC_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_PWC_STC                          *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_PWM_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_PWM_STC                          *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_RT_STC                            *((volatile  uint8_t*)(0x40025650UL))
#define FM4_BT13_RT_STC                           *((volatile  uint8_t*)(0x40025650UL))
#define FM_BT13_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025651UL))
#define FM_BT13_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025651UL))
#define FM_BT13_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025651UL))
#define FM_BT13_RT_TMCR2                          *((volatile  uint8_t*)(0x40025651UL))
#define FM4_BT13_RT_TMCR2                         *((volatile  uint8_t*)(0x40025651UL))

/*******************************************************************************
* BT Registers BT14
*   Register Definition
*******************************************************************************/
#define FM_BT14_PPG_PRLL                          *((volatile uint16_t*)(0x40025680UL))
#define FM4_BT14_PPG_PRLL                         *((volatile uint16_t*)(0x40025680UL))
#define FM_BT14_PWM_PCSR                          *((volatile uint16_t*)(0x40025680UL))
#define FM4_BT14_PWM_PCSR                         *((volatile uint16_t*)(0x40025680UL))
#define FM_BT14_RT_PCSR                           *((volatile uint16_t*)(0x40025680UL))
#define FM4_BT14_RT_PCSR                          *((volatile uint16_t*)(0x40025680UL))
#define FM_BT14_PPG_PRLH                          *((volatile uint16_t*)(0x40025684UL))
#define FM4_BT14_PPG_PRLH                         *((volatile uint16_t*)(0x40025684UL))
#define FM_BT14_PWC_DTBF                          *((volatile uint16_t*)(0x40025684UL))
#define FM4_BT14_PWC_DTBF                         *((volatile uint16_t*)(0x40025684UL))
#define FM_BT14_PWM_PDUT                          *((volatile uint16_t*)(0x40025684UL))
#define FM4_BT14_PWM_PDUT                         *((volatile uint16_t*)(0x40025684UL))
#define FM_BT14_PPG_TMR                           *((volatile uint16_t*)(0x40025688UL))
#define FM4_BT14_PPG_TMR                          *((volatile uint16_t*)(0x40025688UL))
#define FM_BT14_PWM_TMR                           *((volatile uint16_t*)(0x40025688UL))
#define FM4_BT14_PWM_TMR                          *((volatile uint16_t*)(0x40025688UL))
#define FM_BT14_RT_TMR                            *((volatile uint16_t*)(0x40025688UL))
#define FM4_BT14_RT_TMR                           *((volatile uint16_t*)(0x40025688UL))
#define FM_BT14_PPG_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_PPG_TMCR                         *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_PWC_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_PWC_TMCR                         *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_PWM_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_PWM_TMCR                         *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_RT_TMCR                           *((volatile uint16_t*)(0x4002568CUL))
#define FM4_BT14_RT_TMCR                          *((volatile uint16_t*)(0x4002568CUL))
#define FM_BT14_PPG_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_PPG_STC                          *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_PWC_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_PWC_STC                          *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_PWM_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_PWM_STC                          *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_RT_STC                            *((volatile  uint8_t*)(0x40025690UL))
#define FM4_BT14_RT_STC                           *((volatile  uint8_t*)(0x40025690UL))
#define FM_BT14_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025691UL))
#define FM_BT14_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025691UL))
#define FM_BT14_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025691UL))
#define FM_BT14_RT_TMCR2                          *((volatile  uint8_t*)(0x40025691UL))
#define FM4_BT14_RT_TMCR2                         *((volatile  uint8_t*)(0x40025691UL))

