mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2ghxh/common/s6e2ghxh.h
/*******************************************************************************
* BT Registers BT7
*   Register Definition
*******************************************************************************/
#define FM_BT7_PPG_PRLL                           *((volatile uint16_t*)(0x400252C0UL))
#define FM4_BT7_PPG_PRLL                          *((volatile uint16_t*)(0x400252C0UL))
#define FM_BT7_PWM_PCSR                           *((volatile uint16_t*)(0x400252C0UL))
#define FM4_BT7_PWM_PCSR                          *((volatile uint16_t*)(0x400252C0UL))
#define FM_BT7_RT_PCSR                            *((volatile uint16_t*)(0x400252C0UL))
#define FM4_BT7_RT_PCSR                           *((volatile uint16_t*)(0x400252C0UL))
#define FM_BT7_PPG_PRLH                           *((volatile uint16_t*)(0x400252C4UL))
#define FM4_BT7_PPG_PRLH                          *((volatile uint16_t*)(0x400252C4UL))
#define FM_BT7_PWC_DTBF                           *((volatile uint16_t*)(0x400252C4UL))
#define FM4_BT7_PWC_DTBF                          *((volatile uint16_t*)(0x400252C4UL))
#define FM_BT7_PWM_PDUT                           *((volatile uint16_t*)(0x400252C4UL))
#define FM4_BT7_PWM_PDUT                          *((volatile uint16_t*)(0x400252C4UL))
#define FM_BT7_PPG_TMR                            *((volatile uint16_t*)(0x400252C8UL))
#define FM4_BT7_PPG_TMR                           *((volatile uint16_t*)(0x400252C8UL))
#define FM_BT7_PWM_TMR                            *((volatile uint16_t*)(0x400252C8UL))
#define FM4_BT7_PWM_TMR                           *((volatile uint16_t*)(0x400252C8UL))
#define FM_BT7_RT_TMR                             *((volatile uint16_t*)(0x400252C8UL))
#define FM4_BT7_RT_TMR                            *((volatile uint16_t*)(0x400252C8UL))
#define FM_BT7_PPG_TMCR                           *((volatile uint16_t*)(0x400252CCUL))
#define FM4_BT7_PPG_TMCR                          *((volatile uint16_t*)(0x400252CCUL))
#define FM_BT7_PWC_TMCR                           *((volatile uint16_t*)(0x400252CCUL))
#define FM4_BT7_PWC_TMCR                          *((volatile uint16_t*)(0x400252CCUL))
#define FM_BT7_PWM_TMCR                           *((volatile uint16_t*)(0x400252CCUL))
#define FM4_BT7_PWM_TMCR                          *((volatile uint16_t*)(0x400252CCUL))
#define FM_BT7_RT_TMCR                            *((volatile uint16_t*)(0x400252CCUL))
#define FM4_BT7_RT_TMCR                           *((volatile uint16_t*)(0x400252CCUL))
#define FM_BT7_PPG_STC                            *((volatile  uint8_t*)(0x400252D0UL))
#define FM4_BT7_PPG_STC                           *((volatile  uint8_t*)(0x400252D0UL))
#define FM_BT7_PWC_STC                            *((volatile  uint8_t*)(0x400252D0UL))
#define FM4_BT7_PWC_STC                           *((volatile  uint8_t*)(0x400252D0UL))
#define FM_BT7_PWM_STC                            *((volatile  uint8_t*)(0x400252D0UL))
#define FM4_BT7_PWM_STC                           *((volatile  uint8_t*)(0x400252D0UL))
#define FM_BT7_RT_STC                             *((volatile  uint8_t*)(0x400252D0UL))
#define FM4_BT7_RT_STC                            *((volatile  uint8_t*)(0x400252D0UL))
#define FM_BT7_PPG_TMCR2                          *((volatile  uint8_t*)(0x400252D1UL))
#define FM4_BT7_PPG_TMCR2                         *((volatile  uint8_t*)(0x400252D1UL))
#define FM_BT7_PWC_TMCR2                          *((volatile  uint8_t*)(0x400252D1UL))
#define FM4_BT7_PWC_TMCR2                         *((volatile  uint8_t*)(0x400252D1UL))
#define FM_BT7_PWM_TMCR2                          *((volatile  uint8_t*)(0x400252D1UL))
#define FM4_BT7_PWM_TMCR2                         *((volatile  uint8_t*)(0x400252D1UL))
#define FM_BT7_RT_TMCR2                           *((volatile  uint8_t*)(0x400252D1UL))
#define FM4_BT7_RT_TMCR2                          *((volatile  uint8_t*)(0x400252D1UL))

/*******************************************************************************
* BT Registers BT8
*   Register Definition
*******************************************************************************/
#define FM_BT8_PPG_PRLL                           *((volatile uint16_t*)(0x40025400UL))
#define FM4_BT8_PPG_PRLL                          *((volatile uint16_t*)(0x40025400UL))
#define FM_BT8_PWM_PCSR                           *((volatile uint16_t*)(0x40025400UL))
#define FM4_BT8_PWM_PCSR                          *((volatile uint16_t*)(0x40025400UL))
#define FM_BT8_RT_PCSR                            *((volatile uint16_t*)(0x40025400UL))
#define FM4_BT8_RT_PCSR                           *((volatile uint16_t*)(0x40025400UL))
#define FM_BT8_PPG_PRLH                           *((volatile uint16_t*)(0x40025404UL))
#define FM4_BT8_PPG_PRLH                          *((volatile uint16_t*)(0x40025404UL))
#define FM_BT8_PWC_DTBF                           *((volatile uint16_t*)(0x40025404UL))
#define FM4_BT8_PWC_DTBF                          *((volatile uint16_t*)(0x40025404UL))
#define FM_BT8_PWM_PDUT                           *((volatile uint16_t*)(0x40025404UL))
#define FM4_BT8_PWM_PDUT                          *((volatile uint16_t*)(0x40025404UL))
#define FM_BT8_PPG_TMR                            *((volatile uint16_t*)(0x40025408UL))
#define FM4_BT8_PPG_TMR                           *((volatile uint16_t*)(0x40025408UL))
#define FM_BT8_PWM_TMR                            *((volatile uint16_t*)(0x40025408UL))
#define FM4_BT8_PWM_TMR                           *((volatile uint16_t*)(0x40025408UL))
#define FM_BT8_RT_TMR                             *((volatile uint16_t*)(0x40025408UL))
#define FM4_BT8_RT_TMR                            *((volatile uint16_t*)(0x40025408UL))
#define FM_BT8_PPG_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_PPG_TMCR                          *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_PWC_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_PWC_TMCR                          *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_PWM_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_PWM_TMCR                          *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_RT_TMCR                            *((volatile uint16_t*)(0x4002540CUL))
#define FM4_BT8_RT_TMCR                           *((volatile uint16_t*)(0x4002540CUL))
#define FM_BT8_PPG_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_PPG_STC                           *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_PWC_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_PWC_STC                           *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_PWM_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_PWM_STC                           *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_RT_STC                             *((volatile  uint8_t*)(0x40025410UL))
#define FM4_BT8_RT_STC                            *((volatile  uint8_t*)(0x40025410UL))
#define FM_BT8_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025411UL))
#define FM_BT8_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025411UL))
#define FM_BT8_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025411UL))
#define FM_BT8_RT_TMCR2                           *((volatile  uint8_t*)(0x40025411UL))
#define FM4_BT8_RT_TMCR2                          *((volatile  uint8_t*)(0x40025411UL))

